In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({'Name':['a','b','c','b','a','a','c','c','b'],'sub1':[11,12,13,22,24,26,11,22,32],'sub2':[22,21,23,32,33,23,26,27,31]})
df

  Name  sub1  sub2
0    a    11    22
1    b    12    21
2    c    13    23
3    b    22    32
4    a    24    33
5    a    26    23
6    c    11    26
7    c    22    27
8    b    32    31

In [4]:
ndf=df.groupby("Name")

In [9]:
for i,j in ndf:
    print(i)
    print(j)
    print()

a
  Name  sub1  sub2
0    a    11    22
4    a    24    33
5    a    26    23

b
  Name  sub1  sub2
1    b    12    21
3    b    22    32
8    b    32    31

c
  Name  sub1  sub2
2    c    13    23
6    c    11    26
7    c    22    27

In [10]:
ndf.get_group('a')

  Name  sub1  sub2
0    a    11    22
4    a    24    33
5    a    26    23

In [12]:
ndf.get_group('b')

  Name  sub1  sub2
1    b    12    21
3    b    22    32
8    b    32    31

In [14]:
ndf.min()

      sub1  sub2
Name
a       11    22
b       12    21
c       11    23

In [15]:
ndf.max()

      sub1  sub2
Name
a       26    33
b       32    32
c       22    27

In [16]:
ndf.mean()

           sub1       sub2
Name
a     20.333333  26.000000
b     22.000000  28.000000
c     15.333333  25.333333